MikroElektronika/core_packages/ARM/gcc_clang/def/sam/SAMG51G18A/mcu.h
/**
 * \file
 *
 * \brief Header file for ATSAMG51G18
 *
 * Copyright (c) 2017 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2017-07-05T18:00:00Z */
#ifndef _SAMG51G18_H_
#define _SAMG51G18_H_

/** \addtogroup SAMG51G18_definitions SAMG51G18 definitions
  This file defines all structures and symbols for SAMG51G18:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

/** \defgroup Atmel_glob_defs Atmel Global Defines

    <strong>IO Type Qualifiers</strong> are used
    \li to specify the access to peripheral variables.
    \li for automatic generation of peripheral register debug information.

    \remark
    CMSIS core has a syntax that differs from this using i.e. __I, __O, or __IO followed by 'uint<size>_t' respective types.
    Default the header files will follow the CMSIS core syntax.
 *  @{
 */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>

/* IO definitions (access restrictions to peripheral registers) */
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint32_t WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */

#define CAST(type, value) ((type *)(value)) /**< Pointer Type Conversion Macro for C/C++ */
#define REG_ACCESS(type, address) (*(type*)(address)) /**< C code: Register value */
#else /* Assembler */
#define CAST(type, value) (value) /**< Pointer Type Conversion Macro for Assembler */
#define REG_ACCESS(type, address) (address) /**< Assembly code: Register address */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)

#if defined(_U_) || defined(_L_) || defined(_UL_)
  #error "Integer Literals macros already defined elsewhere"
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#define _U_(x) x ## U    /**< C code: Unsigned integer literal constant value */
#define _L_(x) x ## L    /**< C code: Long integer literal constant value */
#define _UL_(x) x ## UL  /**< C code: Unsigned Long integer literal constant value */

#else /* Assembler */

#define _U_(x) x    /**< Assembler: Unsigned integer literal constant value */
#define _L_(x) x    /**< Assembler: Long integer literal constant value */
#define _UL_(x) x   /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#endif /* SKIP_INTEGER_LITERALS */
/** @}  end of Atmel Global Defines */

/** \addtogroup SAMG51G18_cmsis CMSIS Definitions
 *  @{
 */
/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAMG51G18 */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M4 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /**< 1   Reset Vector, invoked on Power up and warm reset  */
  NonMaskableInt_IRQn       = -14, /**< 2   Non maskable Interrupt, cannot be stopped or preempted  */
  HardFault_IRQn            = -13, /**< 3   Hard Fault, all classes of Fault     */
  MemoryManagement_IRQn     = -12, /**< 4   Memory Management, MPU mismatch, including Access Violation and No Match  */
  BusFault_IRQn             = -11, /**< 5   Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault  */
  UsageFault_IRQn           = -10, /**< 6   Usage Fault, i.e. Undef Instruction, Illegal State Transition  */
  SVCall_IRQn               = -5 , /**< 11  System Service Call via SVC instruction  */
  DebugMonitor_IRQn         = -4 , /**< 12  Debug Monitor                        */
  PendSV_IRQn               = -2 , /**< 14  Pendable request for system service  */
  SysTick_IRQn              = -1 , /**< 15  System Tick Timer                    */
/******  SAMG51G18 specific Interrupt Numbers ***********************************/
  SUPC_IRQn                 = 0  , /**< 0   SAMG51G18 Supply Controller (SUPC)  */
  RSTC_IRQn                 = 1  , /**< 1   SAMG51G18 Reset Controller (RSTC)   */
  RTC_IRQn                  = 2  , /**< 2   SAMG51G18 Real-time Clock (RTC)     */
  RTT_IRQn                  = 3  , /**< 3   SAMG51G18 Real-time Timer (RTT)     */
  WDT_IRQn                  = 4  , /**< 4   SAMG51G18 Watchdog Timer (WDT)      */
  PMC_IRQn                  = 5  , /**< 5   SAMG51G18 Power Management Controller (PMC) */
  EFC_IRQn                  = 6  , /**< 6   SAMG51G18 Embedded Flash Controller (EFC) */
  UART0_IRQn                = 8  , /**< 8   SAMG51G18 Universal Asynchronous Receiver Transmitter (UART0) */
  UART1_IRQn                = 9  , /**< 9   SAMG51G18 Universal Asynchronous Receiver Transmitter (UART1) */
  PIOA_IRQn                 = 11 , /**< 11  SAMG51G18 Parallel Input/Output Controller (PIOA) */
  PIOB_IRQn                 = 12 , /**< 12  SAMG51G18 Parallel Input/Output Controller (PIOB) */
  USART_IRQn                = 14 , /**< 14  SAMG51G18 Universal Synchronous Asynchronous Receiver Transmitter (USART) */
  MEM2MEM_IRQn              = 15 , /**< 15  SAMG51G18 Memory to Memory (MEM2MEM) */
  TWI0_IRQn                 = 19 , /**< 19  SAMG51G18 Two-wire Interface High Speed (TWI0) */
  TWI1_IRQn                 = 20 , /**< 20  SAMG51G18 Two-wire Interface (TWI1) */
  SPI_IRQn                  = 21 , /**< 21  SAMG51G18 Serial Peripheral Interface (SPI) */
  TWI2_IRQn                 = 22 , /**< 22  SAMG51G18 Two-wire Interface (TWI2) */
  TC0_IRQn                  = 23 , /**< 23  SAMG51G18 Timer Counter (TC0)       */
  TC1_IRQn                  = 24 , /**< 24  SAMG51G18 Timer Counter (TC0)       */
  TC2_IRQn                  = 25 , /**< 25  SAMG51G18 Timer Counter (TC0)       */
  ADC_IRQn                  = 29 , /**< 29  SAMG51G18 Analog-to-Digital Converter (ADC) */

  PERIPH_COUNT_IRQn        = 30  /**< Number of peripheral IDs */
} IRQn_Type;
